{
    "query": "alberta min_faves:100 since:2026-02-19",
    "count": 43,
    "results": [
        {
            "author": "The American Culturist (@MericaCulture)",
            "time": "1h",
            "text": "The U.S. men's Olympic hockey team just defeated Slovakia 6-2 By the ancient laws of combat, Slovakia is now rightfully ours. If you've been keeping track we now have legitimate claims to Greenland, IKEA, Alberta and Slovakia. Quote The American Culturist @MericaCulture · Feb 18 The U.S. men's Olympic hockey team just defeated Sweden 2-1 By the ancient laws of combat, IKEA is now rightfully ours.  x.com/mericaculture/… 13 116 1.4K 23K",
            "metrics": {
                "rp": "13",
                "rt": "116",
                "lk": "1.4K"
            },
            "media": [
                "https://pbs.twimg.com/media/HBoqegSXkAEavvh?format=jpg&name=small",
                "https://pbs.twimg.com/media/HBeXByFW4AACPN1?format=jpg&name=240x240"
            ]
        },
        {
            "author": "Tablesalt (@Tablesalt13)",
            "time": "2h",
            "text": "BREAKING Alberta Premier Smith announces a fall REFERENDUM on immigration to Alberta \"immigration has flooded our hospital rooms and classrooms and social support\" \"there are 140k students in the English as a second languages classes\" The media could not be played. Reload",
            "metrics": {
                "rp": "56",
                "rt": "150",
                "lk": "1.1K"
            },
            "media": []
        },
        {
            "author": "ABP.IO (@abpframework)",
            "time": "- Startup Templates",
            "text": "- SaaS Toolkit - Multi-tenancy - Domain-Driven Design All inside one .NET platform. Check ABP Now",
            "metrics": {
                "rp": "31",
                "rt": "20",
                "lk": "129"
            },
            "media": []
        },
        {
            "author": "YEGWAVE (@yegwave)",
            "time": "2h",
            "text": "BREAKING: Danielle Smith confirms that if the Alberta independence petition reaches the required signatures, it will be placed on the ballot. The media could not be played. Reload",
            "metrics": {
                "rp": "48",
                "rt": "72",
                "lk": "557"
            },
            "media": []
        },
        {
            "author": "Defiant L’s (@DefiantLs)",
            "time": "1h",
            "text": "Alberta Premier Danielle Smith: \"Throwing the doors wide open to anyone and everyone across the globe has flooded our classrooms, emergency rooms and social support systems with far too many people, far too quickly.\" The media could not be played. Reload",
            "metrics": {
                "rp": "30",
                "rt": "58",
                "lk": "433"
            },
            "media": []
        },
        {
            "author": "Jeffrey Rath (@JeffreyRWRath)",
            "time": "2h",
            "text": "People being bankrupted for an opinion. Alberta needs to leave the clown show called Canada. Quote Juno News @junonewscom · 7h A former Chilliwack school trustee has been hit with a massive $750,000 fine by the B.C. Human Rights Tribunal after his public comments about gender ideology were ruled to be hate speech. https:// junonews.com/p/former-bc-sc hool-trustee-fined-750k# … 10 85 357 3.7K",
            "metrics": {
                "rp": "10",
                "rt": "85",
                "lk": "357"
            },
            "media": []
        },
        {
            "author": "Danielle Smith (@ABDanielleSmith)",
            "time": "2h",
            "text": "Although sustainable immigration has always been an important part of Alberta’s history as a province, the immigration policies of the federal government over the last five years have put tremendous pressure on classrooms, emergency rooms and social support systems. These Show more The media could not be played. Reload 234 96 480 15K",
            "metrics": {
                "rp": "234",
                "rt": "96",
                "lk": "480"
            },
            "media": []
        },
        {
            "author": "Carrie Tait (@CarrieTait)",
            "time": "3h",
            "text": "Premier Danielle Smith said she doesn't know how much newcomers cost Alberta’s health care and education systems, despite scheduling a referendum to ask whether social services to those residents should be limited b/c of cost https:// theglobeandmail.com/canada/alberta /article-danielle-smith-referendum-immigration-ndp/?utm_medium=Referrer:+Social+Network+/+Media&utm_campaign=Shared+Web+Article+Links … By @mattscace67 and friend Alberta Premier defends fall referendum plans",
            "metrics": {
                "rp": "49",
                "rt": "154",
                "lk": "320"
            },
            "media": []
        },
        {
            "author": "Jasmin Laine (@JasminLaine_)",
            "time": "3h",
            "text": "WATCH: Reports show that businesses are LEAVING British Columbia to move to Alberta, after David Eby’s high-deficit budget… Here’s David Eby’s reaction. The media could not be played. Reload",
            "metrics": {
                "rp": "129",
                "rt": "205",
                "lk": "879"
            },
            "media": []
        },
        {
            "author": "Rise Of Alberta (@RiseOfAlberta)",
            "time": "4h",
            "text": "BREAKING: Danielle Smith confirms that if the Alberta independence petition reaches the required signatures, it will be placed on the ballot. It would be voted on the same day as other referendum questions on October 19, 2026. The media could not be played. Reload 100 365 1.5K 43K",
            "metrics": {
                "rp": "100",
                "rt": "365",
                "lk": "1.5K"
            },
            "media": []
        },
        {
            "author": "The Breakdown (@TheBreakdownAB)",
            "time": "5h",
            "text": "Rakhi Pancholi made it very clear today… She believes that Smith’s rhetoric is absolutely fueling racism and bigotry in Alberta and called out her failure to condemn Bruce McAllisters recent bigoted comments. #abpoli #ableg #cdnpoli The media could not be played. Reload 25 210 582 7.6K",
            "metrics": {
                "rp": "25",
                "rt": "210",
                "lk": "582"
            },
            "media": []
        },
        {
            "author": "VisuallyBetter (@Isuckatpicking)",
            "time": "5h",
            "text": "Somewhere in Alberta right now a pro-51st state separatist is saying Alberta teachers are grooming kids to be pro Canada by showing the Olympic hockey game this morning at school. 8 41 316 5.4K",
            "metrics": {
                "rp": "8",
                "rt": "41",
                "lk": "316"
            },
            "media": []
        },
        {
            "author": "Danielle Smith (@ABDanielleSmith)",
            "time": "5h",
            "text": "Your government will be updating Albertans this morning and taking questions from the media about our recent referendum announcement and how it will protect Alberta’s interests and priorities. We cannot play the video in this browser. Please try a different web browser. Danielle Smith @ABDanielleSmith Media Availability for Alberta Referendum 186 75 287 19K",
            "metrics": {
                "rp": "186",
                "rt": "75",
                "lk": "287"
            },
            "media": []
        },
        {
            "author": "Michael Thomlinson (@miket136)",
            "time": "7h",
            "text": "There’s only one referendum question that matters. The one that makes all the others irrelevant. Free Alberta. 20 45 355 3K",
            "metrics": {
                "rp": "20",
                "rt": "45",
                "lk": "355"
            },
            "media": []
        },
        {
            "author": "Michael (@mikethenavyguy)",
            "time": "7h",
            "text": "I'll go with not screwed at all. Alberta on the other hand would struggle economically and lose access to tidewater without an agreement which will likely mean paying for access. You folks are not living in the real world. Quote AwakenedOutlaw @AwakenedOutlaw · Feb 19 How screwed is Canada when, not if, Alberta secedes, you ask? This screwed.  x.com/theepicmap/sta… 59 56 1.7K 84K",
            "metrics": {
                "rp": "59",
                "rt": "56",
                "lk": "1.7K"
            },
            "media": [
                "https://pbs.twimg.com/media/HBiogTtaAAAOP-_?format=png&name=small"
            ]
        },
        {
            "author": "Ezra Levant (@ezralevant)",
            "time": "7h",
            "text": "Deepest Toronto has a message for Alberta: 1. You're not allowed to leave, even with a court-approved referendum. 2. Oh, and you're not allowed to change anything if you stay. Quote Andrew Coyne @acoyne · 20h Oh God this country is insane. Multiple referendums demanding constitutional changes that are a) not within Alberta's bailiwick, b) not practically possible, c) not a good idea, or d) all three. This is the lamest good cop-bad cop routine of all time. Braid: There will be Show more 34 158 773 21K",
            "metrics": {
                "rp": "34",
                "rt": "158",
                "lk": "773"
            },
            "media": []
        },
        {
            "author": "Matt Grier (@MattGrierMusic)",
            "time": "7h",
            "text": "Alberta would need 11 new hospitals to get us up to the Canadian average. So let’s not get too wrapped up in blaming immigrants. Our own government has been negligent and hasn’t built the infrastructure we deserve. Start building, stop blaming immigrants. Quote Dr. Lynora Saxinger MD FRCPC Infectious Diseases @AntibioticDoc · Feb 5 TL;DR: Alberta would need 11 hospitals in Edmonton and Calgary to be resourced to the Canadian average. 1/6  Why is Alberta’s healthcare system under such strain? It’s not \"management\"—it’s a numbers problem 40 years in the making. Let’s look at the data.  #AbLeg #CdnHealth 35 141 289 4.8K",
            "metrics": {
                "rp": "35",
                "rt": "141",
                "lk": "289"
            },
            "media": [
                "https://pbs.twimg.com/media/HAbmp4FWYAAJsms?format=jpg&name=small"
            ]
        },
        {
            "author": "Erik Thorvaldsson (@erik_thorvalds)",
            "time": "7h",
            "text": "I predict a lot of Independence supporters are going to walk away from the @Alberta_UCP . It’s fully deserved. @ABDanielleSmith has made a massive mistake playing with the federalists when more than half of her party is sovereigntist. 83 99 420 4.7K",
            "metrics": {
                "rp": ".",
                "rt": "83",
                "lk": "99"
            },
            "media": [
                "https://pbs.twimg.com/media/HBnQSyLbAAER_D1?format=jpg&name=small"
            ]
        },
        {
            "author": "Christina McKinley (@ChristinaKottm2)",
            "time": "8h",
            "text": "Traversing snowy trails in Northern Alberta! 9 20 190 1K",
            "metrics": {
                "rp": "9",
                "rt": "20",
                "lk": "190"
            },
            "media": [
                "https://pbs.twimg.com/media/HBnOl3kbcAAVlvz?format=jpg&name=small"
            ]
        },
        {
            "author": "Canadian Albertan (@furmsies)",
            "time": "8h",
            "text": "So let me get this strait. A couple years ago Danielle Smith said she was going to ramp.up immigration to Alberta by millions of people. Now she is blaming all of the Alberta problems on immigration. Did I get that right? 25 51 236 3.2K",
            "metrics": {
                "rp": "25",
                "rt": "51",
                "lk": "236"
            },
            "media": []
        },
        {
            "author": "Jeffrey Rath (@JeffreyRWRath)",
            "time": "8h",
            "text": "BREAKING - ALBERTA @ABDanielleSmith Announces an IMMIGRATION CRISIS! Her bold plan - talk about it for 8 months and then hold a vote in October to determine if it’s really a problem. It’s the equivalent of watching your house burn down and instead of calling 911 you decide Show more 121 309 900 10K",
            "metrics": {
                "rp": "121",
                "rt": "309",
                "lk": "900"
            },
            "media": [
                "https://pbs.twimg.com/media/HBnLtoNaIAAwUNi?format=jpg&name=900x900"
            ]
        },
        {
            "author": "Sean Amato (@JSJamato)",
            "time": "8h",
            "text": "Former Alberta Premier Rachel Notley is weighing in on Premier Smith’s address last night (via FB post.) She’s one of many people now using the word “racism/racist.” #ableg #cdnpoli 67 201 485 13K",
            "metrics": {
                "rp": "67",
                "rt": "201",
                "lk": "485"
            },
            "media": [
                "https://pbs.twimg.com/media/HBnI4oGaIAAwL0p?format=jpg&name=360x360",
                "https://pbs.twimg.com/media/HBnI4oLbgAABRTB?format=jpg&name=small"
            ]
        },
        {
            "author": "Sean Amato (@JSJamato)",
            "time": "8h",
            "text": "Why is Alberta broke? The answer is actually bragged about in the provincial budget, every year. Alberta could eliminate its debt, invest in services, save billions, and still have the lowest taxes in . Instead, immigrants are blamed. #ableg #cdnpoli 90 194 458 20K",
            "metrics": {
                "rp": "90",
                "rt": "194",
                "lk": "458"
            },
            "media": [
                "https://pbs.twimg.com/media/HBnFbYwbUAADGtD?format=jpg&name=small"
            ]
        },
        {
            "author": "Andrew Friesen (@friesen_f)",
            "time": "9h",
            "text": "Blaming immigrants for Alberta’s deficit doesn’t seem to hold up. Smith appears scapegoating immigrants for her poor fiscal management; Refugee claimants’ healthcare is largely covered by the federal IFHP, no cost to AB International students mostly don’t use Alberta Show more 40 192 500 7.3K",
            "metrics": {
                "rp": "40",
                "rt": "192",
                "lk": "500"
            },
            "media": []
        },
        {
            "author": "ProudCanRobz (@RMapleCan)",
            "time": "9h",
            "text": "67% of Canadians are solidly behind Prime Minister Mark Carney - 72% in QUEBEC, 66% in ALBERTA! That's is indeed a SOLID and NATIONAL support. Quote CityNews Toronto @CityNewsTO · 13h New poll finds Prime Minister Mark Carney has broad coalition of support among Canadians for his economic plan. https:// toronto.citynews.ca/2026/02/20/pol l-canadians-broad-support-mark-carney-economic-plan/ … 273 225 823 19K",
            "metrics": {
                "rp": "273",
                "rt": "225",
                "lk": "823"
            },
            "media": []
        },
        {
            "author": "cbcwatcher (@cbcwatcher)",
            "time": "9h",
            "text": "CBC's Janyce McGregor admits that Alberta is using the Quebec playbook to seek similar provincial control over immigration \"Yeah, it seems like that could be what they're angling for here, using tactics similar to what we've seen used in Quebec,\" But can anyone ever recall Show more The media could not be played. Reload 35 78 362 18K",
            "metrics": {
                "rp": "35",
                "rt": "78",
                "lk": "362"
            },
            "media": []
        },
        {
            "author": "Jason Scott (@JasonOnTheDrums)",
            "time": "9h",
            "text": "#ableg Turns out Alberta doesn’t have an immigration problem. We have a Daniele Smith problem. Quote Andrew Leach @andrew_leach · 20h A reminder: Smith's government has seen the highest real, per capita resource revenue outside of the governments of Lougheed and Klein. To blame immigration because you can't manage a resource boom is awful. She literally \"called\" for people to come her and for high immigration. 42 282 731 10K",
            "metrics": {
                "rp": "42",
                "rt": "282",
                "lk": "731"
            },
            "media": [
                "https://pbs.twimg.com/media/HBm7g5KbsAAFFtX?format=jpg&name=small",
                "https://pbs.twimg.com/media/HBko5SXacAAJNuD?format=jpg&name=240x240"
            ]
        },
        {
            "author": "David Weigel (@daveweigel)",
            "time": "9h",
            "text": "Carney’s Liberals surging in Alberta after Alberta separatists met w Trump officials Quote Dan Arnold @calgarygrit · 11h Conservatives up by 3 points. Finally a poll with them in the lead! (Oh wait...) x.com/CanadianPollin… 13 91 865 78K",
            "metrics": {
                "rp": "13",
                "rt": "91",
                "lk": "865"
            },
            "media": []
        },
        {
            "author": "David Parker (@DavidJPba)",
            "time": "9h",
            "text": "If the Mainstreet Poll is true, Albertans have finally given up on Pierre and the Conservative Party of Canada. Expect a Federal Alberta Independence Party to emerge and get seats. 38 32 238 6.5K",
            "metrics": {
                "rp": "38",
                "rt": "32",
                "lk": "238"
            },
            "media": []
        },
        {
            "author": "Barbara Larochelle (@BarbLarochelle)",
            "time": "9h",
            "text": "Question for Dani and her dogwhistle referendum: if the people who had answered the ‘Alberta is Calling’ campaign when you wanted to double our population, had been from other provinces and not immigrants,  were there enough spaces in our hospitals and schools for their families? 7 42 187 2.6K",
            "metrics": {
                "rp": "7",
                "rt": "42",
                "lk": "187"
            },
            "media": []
        },
        {
            "author": "Bradley Lafortune (@BradLafortune)",
            "time": "9h",
            "text": "Danielle Smith incompetent and cruel. Her own government is STILL paying people $5000 to come to Alberta. #ableg 30 132 236 5.7K",
            "metrics": {
                "rp": "30",
                "rt": "132",
                "lk": "236"
            },
            "media": [
                "https://pbs.twimg.com/media/HBm3zF_awAA6bHi?format=jpg&name=small",
                "https://pbs.twimg.com/media/HBm3zGAasAAPQF0?format=jpg&name=small",
                "https://pbs.twimg.com/media/HBm3zGBacAAlh5v?format=jpg&name=small"
            ]
        },
        {
            "author": "Cory Morgan (@CoryBMorgan)",
            "time": "10h",
            "text": "There you have it folks. Laurentian Canada is already telling Alberta that constitutional changes are never coming. That leaves one option. Independence. Quote Andrew Coyne @acoyne · 20h Oh God this country is insane. Multiple referendums demanding constitutional changes that are a) not within Alberta's bailiwick, b) not practically possible, c) not a good idea, or d) all three. This is the lamest good cop-bad cop routine of all time. Braid: There will be Show more 33 190 777 14K",
            "metrics": {
                "rp": "33",
                "rt": "190",
                "lk": "777"
            },
            "media": []
        },
        {
            "author": "Danielle Smith ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎ ‎(Parody) (@ABDanielSmith)",
            "time": "10h",
            "text": "Hmmm. Maybe I shouldn’t have: Spent millions on an “Alberta is Calling” campaign Wrote a letter to Trudeau begging for more immigrants Told podcast interviewers I want to double Alberta’s population Budgeted on $90/barrel oil #abpoli #ableg The media could not be played. Reload",
            "metrics": {
                "rp": "20",
                "rt": "220",
                "lk": "580"
            },
            "media": []
        },
        {
            "author": "Cory Morgan (@CoryBMorgan)",
            "time": "10h",
            "text": "As Laurentian Canada tells Alberta to stuff its constitutional change notions up its ass, the only referendum question that matters will gain support. That is the one on full independence. 15 134 554 4.7K",
            "metrics": {
                "rp": "15",
                "rt": "134",
                "lk": "554"
            },
            "media": []
        },
        {
            "author": "Brian Lilley (@brianlilley)",
            "time": "10h",
            "text": "Premier Danielle Smith cites two main budget pressures for Alberta. * The price of oil being lower than they need. * Population growth outpacing revenue. For Alberta, the challenge is immigration AND migration from other parts of Canada into Alberta. The media could not be played. Reload",
            "metrics": {
                "rp": "71",
                "rt": "64",
                "lk": "429"
            },
            "media": []
        },
        {
            "author": "Bruce Arthur (@bruce_arthur)",
            "time": "11h",
            "text": "First she plays with live ammo over a deluded, traitorous version of separation, and now she fans anti-immigrant sentiments two years after inviting immigrants to Alberta. Danielle Smith is the most reckless, dangerous, incompetent premier I have ever seen Quote Kent Fellows @GK_Fellows · Feb 19 Anyone who has not been watching Alberta politics over the last 24 months might be surprised to learn that the Premier is currently angry about how HIGH our recent growth rate is (<2%), contrary to her expectations of a higher growth rate required to hit 10m by 2050 (~2.8%).  x.com/andrew_leach/s… 49 287 843 29K",
            "metrics": {
                "rp": "49",
                "rt": "287",
                "lk": "843"
            },
            "media": [
                "https://pbs.twimg.com/media/HBjxRhUbUAAg-4f?format=png&name=small"
            ]
        },
        {
            "author": "Rebel News (@RebelNewsOnline)",
            "time": "11h",
            "text": "The Alberta Independence Tour! February 20 — Red Deer February 21 — Edmonton February 26 — Calgary February 27 — Medicine Hat February 28 — Lethbridge March 5 — Westlock March 6 — Grande Prairie TICKETS: http:// IndependenceTour.com. Alberta Independence Tour - Rebel News",
            "metrics": {
                "rp": "11",
                "rt": "119",
                "lk": "206"
            },
            "media": []
        },
        {
            "author": "Melanie (@Mellyfax)",
            "time": "11h",
            "text": "Reminder: In 2024, @ABDanielleSmith requested 10,000 extra spots for Ukrainian evacuees plus 20,000 more under Alberta’s nominee program. The record is public. 109 219 2.6K",
            "metrics": {
                "rp": "109",
                "rt": "219",
                "lk": "2.6K"
            },
            "media": [
                "https://pbs.twimg.com/media/HBmi-FEXkAAaXxX?format=jpg&name=360x360",
                "https://pbs.twimg.com/media/HBmi-FCWUAAfSNL?format=jpg&name=360x360"
            ]
        },
        {
            "author": "MRG Live (@MRGLiveOfficial)",
            "time": "SHINEDOWN NATION! The DANCE, KID, DANCE ACT II tour tickets are on sale NOW! Featuring special guests Coheed & Cambria and From Ashes To New at Rogers Place on August 17th. Don't miss out!",
            "text": "Shinedown in Edmonton August 17th | Tickets on sale now",
            "metrics": {
                "rp": "0",
                "rt": "0",
                "lk": "0"
            },
            "media": []
        },
        {
            "author": "Thomas A. Lukaszuk (@LukaszukAB)",
            "time": "11h",
            "text": "Recently, UCP government advertised that “Alberta is open for business”, wanting to grow Alberta’s population to 10 million by 2030. Now, influx on new Canadians is blamed for overcrowded hospitals, schools, and deficit. In reality, mismanagement is the culprit, not immigrants. 53 314 1K 12K",
            "metrics": {
                "rp": "53",
                "rt": "314",
                "lk": "1K"
            },
            "media": []
        },
        {
            "author": "JB (@JackieBee_16)",
            "time": "11h",
            "text": "The same Danielle Smith who told Trudeau we needed more immigrants in Alberta & started the “Alberta is Calling” push for immigration…. And now she’s all “oh we have too many immigrants - dammit Trudeau you suck” Not one shred of integrity lives in her body Quote Courtney Theriault @cspotweet · 21h Here's Premier Danielle Smith explaining why she believes immigration is a root cause of Alberta's budget issues The media could not be played. Reload 25 55 221 5.1K",
            "metrics": {
                "rp": "25",
                "rt": "55",
                "lk": "221"
            },
            "media": []
        },
        {
            "author": "Thomas A. Lukaszuk (@LukaszukAB)",
            "time": "11h",
            "text": "Immigrants are not Alberta’s problem. They’re here legally. They’re the ones serving you coffee at Timmies. Populist governments need a scapegoat, an “out-group”. For Hitler it was Jews, for Trump it’s Latinos. It’s an un-Canadian and deplorable political strategy. #ableg 643 537 1.9K 46K",
            "metrics": {
                "rp": "643",
                "rt": "537",
                "lk": "1.9K"
            },
            "media": []
        },
        {
            "author": "StephanoBarberis (@HelloStephano)",
            "time": "16h",
            "text": "Hell has indeed frozen over. More Lib seats than Con seats in Alberta if there were an election now. Unheard of. Thanks, PoiliNever! Quote Polling Canada @CanadianPolling · 20h Here's that Mainstreet Alberta poll mapped out btw LPC 19 CPC 18 4 172 803 24K",
            "metrics": {
                "rp": "4",
                "rt": "172",
                "lk": "803"
            },
            "media": [
                "https://pbs.twimg.com/media/HBkoahfXUAA7B7n?format=png&name=360x360",
                "https://pbs.twimg.com/media/HBkogZRXUAAegSp?format=png&name=360x360",
                "https://pbs.twimg.com/media/HBkoiKvW8AASh0z?format=png&name=360x360"
            ]
        }
    ]
}